app/controllers/api/tournaments_controller.rb

  def index
  	tournaments = Tournament.all
---
SELECT "tournaments".* FROM "tournaments"

  def create
  	tournament = Tournament.create(name: params[:tournament][:name])
---
INSERT INTO "tournaments" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "hola"], ["created_at", "2015-09-21 15:40:30.822330"], ["updated_at", "2015-09-21 15:40:30.822330"]]

  def destroy
  	Tournament.destroy(params[:id])
  	tournaments = Tournament.all
---
DELETE FROM "tournaments" WHERE "tournaments"."id" = $1  [["id", 1]]
SELECT "tournaments".* FROM "tournaments"